<?php
function myFun($string){
    $arr1 = [   
        'а'=>'a', 'б'=>'b', 'в'=>'v', 'г'=>'g', 'д'=>'d', 
        'е'=>'ye', 'ё'=>'yo', 'ж'=>'zh', 'з'=>'z', 'и'=>'i', 
        'к'=>'k', 'л'=>'l','м'=>'m', 'н'=>'n','о'=>'o', 'п'=>'p',
        'р'=>'r', 'с'=>'s', 'т'=>'t', 'у'=>'u','ф'=>'f','х'=>'kh', 
        'ц'=>'ts', 'ч'=>'ch', 'ш'=>'sh','щ'=>'tch', 'ъ'=>'"', 'ы'=>'y', 
        'ь'=>'`', 'э'=>'eh', 'ю'=>'yu', 'я'=>'ya'   
    ];
    $arr2 = str_split($string);
    foreach($arr2 as $value){
        echo $arr1[$value];
    } 
}
    myFun('массив');
?>




